// 0. Вывести квадрат числа

using System;

Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

Console.WriteLine($"Ответ: " + num * num);
