#  0. Вывести квадрат числа

num = int(input("Введите число: "))
print(f"\nКвадратом {num} является {num ** 2}\n")
