# 25. Найти сумму чисел от 1 до А

print(sum([i for i in range(1, int(input("Введите размер массива: ")) + 1)]))
