# 47. Написать программу копирования массива

def array_copy(lst: list):
    return lst.copy()


print(*array_copy([1, 2, 3, 4]))
